; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p12---int100n150-m25---int100c150---s384---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level3 level3)
(sum level0 level13 level13)
(sum level0 level14 level14)
(sum level0 level15 level15)
(sum level0 level17 level17)
(sum level1 level2 level3)
(sum level1 level3 level4)
(sum level1 level13 level14)
(sum level1 level14 level15)
(sum level1 level15 level16)
(sum level1 level17 level18)
(sum level2 level2 level4)
(sum level2 level3 level5)
(sum level2 level13 level15)
(sum level2 level14 level16)
(sum level2 level15 level17)
(sum level2 level17 level19)
(sum level3 level2 level5)
(sum level3 level3 level6)
(sum level3 level13 level16)
(sum level3 level14 level17)
(sum level3 level15 level18)
(sum level3 level17 level20)
(sum level4 level2 level6)
(sum level4 level3 level7)
(sum level4 level13 level17)
(sum level4 level14 level18)
(sum level4 level15 level19)
(sum level4 level17 level21)
(sum level5 level2 level7)
(sum level5 level3 level8)
(sum level5 level13 level18)
(sum level5 level14 level19)
(sum level5 level15 level20)
(sum level5 level17 level22)
(sum level6 level2 level8)
(sum level6 level3 level9)
(sum level6 level13 level19)
(sum level6 level14 level20)
(sum level6 level15 level21)
(sum level6 level17 level23)
(sum level7 level2 level9)
(sum level7 level3 level10)
(sum level7 level13 level20)
(sum level7 level14 level21)
(sum level7 level15 level22)
(sum level7 level17 level24)
(sum level8 level2 level10)
(sum level8 level3 level11)
(sum level8 level13 level21)
(sum level8 level14 level22)
(sum level8 level15 level23)
(sum level8 level17 level25)
(sum level9 level2 level11)
(sum level9 level3 level12)
(sum level9 level13 level22)
(sum level9 level14 level23)
(sum level9 level15 level24)
(sum level9 level17 level26)
(sum level10 level2 level12)
(sum level10 level3 level13)
(sum level10 level13 level23)
(sum level10 level14 level24)
(sum level10 level15 level25)
(sum level10 level17 level27)
(sum level11 level2 level13)
(sum level11 level3 level14)
(sum level11 level13 level24)
(sum level11 level14 level25)
(sum level11 level15 level26)
(sum level11 level17 level28)
(sum level12 level2 level14)
(sum level12 level3 level15)
(sum level12 level13 level25)
(sum level12 level14 level26)
(sum level12 level15 level27)
(sum level12 level17 level29)
(sum level13 level2 level15)
(sum level13 level3 level16)
(sum level13 level13 level26)
(sum level13 level14 level27)
(sum level13 level15 level28)
(sum level13 level17 level30)
(sum level14 level2 level16)
(sum level14 level3 level17)
(sum level14 level13 level27)
(sum level14 level14 level28)
(sum level14 level15 level29)
(sum level14 level17 level31)
(sum level15 level2 level17)
(sum level15 level3 level18)
(sum level15 level13 level28)
(sum level15 level14 level29)
(sum level15 level15 level30)
(sum level15 level17 level32)
(sum level16 level2 level18)
(sum level16 level3 level19)
(sum level16 level13 level29)
(sum level16 level14 level30)
(sum level16 level15 level31)
(sum level16 level17 level33)
(sum level17 level2 level19)
(sum level17 level3 level20)
(sum level17 level13 level30)
(sum level17 level14 level31)
(sum level17 level15 level32)
(sum level17 level17 level34)
(sum level18 level2 level20)
(sum level18 level3 level21)
(sum level18 level13 level31)
(sum level18 level14 level32)
(sum level18 level15 level33)
(sum level18 level17 level35)
(sum level19 level2 level21)
(sum level19 level3 level22)
(sum level19 level13 level32)
(sum level19 level14 level33)
(sum level19 level15 level34)
(sum level19 level17 level36)
(sum level20 level2 level22)
(sum level20 level3 level23)
(sum level20 level13 level33)
(sum level20 level14 level34)
(sum level20 level15 level35)
(sum level20 level17 level37)
(sum level21 level2 level23)
(sum level21 level3 level24)
(sum level21 level13 level34)
(sum level21 level14 level35)
(sum level21 level15 level36)
(sum level21 level17 level38)
(sum level22 level2 level24)
(sum level22 level3 level25)
(sum level22 level13 level35)
(sum level22 level14 level36)
(sum level22 level15 level37)
(sum level22 level17 level39)
(sum level23 level2 level25)
(sum level23 level3 level26)
(sum level23 level13 level36)
(sum level23 level14 level37)
(sum level23 level15 level38)
(sum level23 level17 level40)
(sum level24 level2 level26)
(sum level24 level3 level27)
(sum level24 level13 level37)
(sum level24 level14 level38)
(sum level24 level15 level39)
(sum level24 level17 level41)
(sum level25 level2 level27)
(sum level25 level3 level28)
(sum level25 level13 level38)
(sum level25 level14 level39)
(sum level25 level15 level40)
(sum level25 level17 level42)
(sum level26 level2 level28)
(sum level26 level3 level29)
(sum level26 level13 level39)
(sum level26 level14 level40)
(sum level26 level15 level41)
(sum level26 level17 level43)
(sum level27 level2 level29)
(sum level27 level3 level30)
(sum level27 level13 level40)
(sum level27 level14 level41)
(sum level27 level15 level42)
(sum level27 level17 level44)
(sum level28 level2 level30)
(sum level28 level3 level31)
(sum level28 level13 level41)
(sum level28 level14 level42)
(sum level28 level15 level43)
(sum level28 level17 level45)
(sum level29 level2 level31)
(sum level29 level3 level32)
(sum level29 level13 level42)
(sum level29 level14 level43)
(sum level29 level15 level44)
(sum level29 level17 level46)
(sum level30 level2 level32)
(sum level30 level3 level33)
(sum level30 level13 level43)
(sum level30 level14 level44)
(sum level30 level15 level45)
(sum level30 level17 level47)
(sum level31 level2 level33)
(sum level31 level3 level34)
(sum level31 level13 level44)
(sum level31 level14 level45)
(sum level31 level15 level46)
(sum level31 level17 level48)
(sum level32 level2 level34)
(sum level32 level3 level35)
(sum level32 level13 level45)
(sum level32 level14 level46)
(sum level32 level15 level47)
(sum level32 level17 level49)
(sum level33 level2 level35)
(sum level33 level3 level36)
(sum level33 level13 level46)
(sum level33 level14 level47)
(sum level33 level15 level48)
(sum level33 level17 level50)
(sum level34 level2 level36)
(sum level34 level3 level37)
(sum level34 level13 level47)
(sum level34 level14 level48)
(sum level34 level15 level49)
(sum level34 level17 level51)
(sum level35 level2 level37)
(sum level35 level3 level38)
(sum level35 level13 level48)
(sum level35 level14 level49)
(sum level35 level15 level50)
(sum level35 level17 level52)
(sum level36 level2 level38)
(sum level36 level3 level39)
(sum level36 level13 level49)
(sum level36 level14 level50)
(sum level36 level15 level51)
(sum level36 level17 level53)
(sum level37 level2 level39)
(sum level37 level3 level40)
(sum level37 level13 level50)
(sum level37 level14 level51)
(sum level37 level15 level52)
(sum level37 level17 level54)
(sum level38 level2 level40)
(sum level38 level3 level41)
(sum level38 level13 level51)
(sum level38 level14 level52)
(sum level38 level15 level53)
(sum level38 level17 level55)
(sum level39 level2 level41)
(sum level39 level3 level42)
(sum level39 level13 level52)
(sum level39 level14 level53)
(sum level39 level15 level54)
(sum level39 level17 level56)
(sum level40 level2 level42)
(sum level40 level3 level43)
(sum level40 level13 level53)
(sum level40 level14 level54)
(sum level40 level15 level55)
(sum level40 level17 level57)
(sum level41 level2 level43)
(sum level41 level3 level44)
(sum level41 level13 level54)
(sum level41 level14 level55)
(sum level41 level15 level56)
(sum level41 level17 level58)
(sum level42 level2 level44)
(sum level42 level3 level45)
(sum level42 level13 level55)
(sum level42 level14 level56)
(sum level42 level15 level57)
(sum level42 level17 level59)
(sum level43 level2 level45)
(sum level43 level3 level46)
(sum level43 level13 level56)
(sum level43 level14 level57)
(sum level43 level15 level58)
(sum level43 level17 level60)
(sum level44 level2 level46)
(sum level44 level3 level47)
(sum level44 level13 level57)
(sum level44 level14 level58)
(sum level44 level15 level59)
(sum level44 level17 level61)
(sum level45 level2 level47)
(sum level45 level3 level48)
(sum level45 level13 level58)
(sum level45 level14 level59)
(sum level45 level15 level60)
(sum level45 level17 level62)
(sum level46 level2 level48)
(sum level46 level3 level49)
(sum level46 level13 level59)
(sum level46 level14 level60)
(sum level46 level15 level61)
(sum level46 level17 level63)
(sum level47 level2 level49)
(sum level47 level3 level50)
(sum level47 level13 level60)
(sum level47 level14 level61)
(sum level47 level15 level62)
(sum level47 level17 level64)
(sum level48 level2 level50)
(sum level48 level3 level51)
(sum level48 level13 level61)
(sum level48 level14 level62)
(sum level48 level15 level63)
(sum level48 level17 level65)
(sum level49 level2 level51)
(sum level49 level3 level52)
(sum level49 level13 level62)
(sum level49 level14 level63)
(sum level49 level15 level64)
(sum level49 level17 level66)
(sum level50 level2 level52)
(sum level50 level3 level53)
(sum level50 level13 level63)
(sum level50 level14 level64)
(sum level50 level15 level65)
(sum level50 level17 level67)
(sum level51 level2 level53)
(sum level51 level3 level54)
(sum level51 level13 level64)
(sum level51 level14 level65)
(sum level51 level15 level66)
(sum level51 level17 level68)
(sum level52 level2 level54)
(sum level52 level3 level55)
(sum level52 level13 level65)
(sum level52 level14 level66)
(sum level52 level15 level67)
(sum level52 level17 level69)
(sum level53 level2 level55)
(sum level53 level3 level56)
(sum level53 level13 level66)
(sum level53 level14 level67)
(sum level53 level15 level68)
(sum level53 level17 level70)
(sum level54 level2 level56)
(sum level54 level3 level57)
(sum level54 level13 level67)
(sum level54 level14 level68)
(sum level54 level15 level69)
(sum level54 level17 level71)
(sum level55 level2 level57)
(sum level55 level3 level58)
(sum level55 level13 level68)
(sum level55 level14 level69)
(sum level55 level15 level70)
(sum level55 level17 level72)
(sum level56 level2 level58)
(sum level56 level3 level59)
(sum level56 level13 level69)
(sum level56 level14 level70)
(sum level56 level15 level71)
(sum level56 level17 level73)
(sum level57 level2 level59)
(sum level57 level3 level60)
(sum level57 level13 level70)
(sum level57 level14 level71)
(sum level57 level15 level72)
(sum level57 level17 level74)
(sum level58 level2 level60)
(sum level58 level3 level61)
(sum level58 level13 level71)
(sum level58 level14 level72)
(sum level58 level15 level73)
(sum level58 level17 level75)
(sum level59 level2 level61)
(sum level59 level3 level62)
(sum level59 level13 level72)
(sum level59 level14 level73)
(sum level59 level15 level74)
(sum level60 level2 level62)
(sum level60 level3 level63)
(sum level60 level13 level73)
(sum level60 level14 level74)
(sum level60 level15 level75)
(sum level61 level2 level63)
(sum level61 level3 level64)
(sum level61 level13 level74)
(sum level61 level14 level75)
(sum level62 level2 level64)
(sum level62 level3 level65)
(sum level62 level13 level75)
(sum level63 level2 level65)
(sum level63 level3 level66)
(sum level64 level2 level66)
(sum level64 level3 level67)
(sum level65 level2 level67)
(sum level65 level3 level68)
(sum level66 level2 level68)
(sum level66 level3 level69)
(sum level67 level2 level69)
(sum level67 level3 level70)
(sum level68 level2 level70)
(sum level68 level3 level71)
(sum level69 level2 level71)
(sum level69 level3 level72)
(sum level70 level2 level72)
(sum level70 level3 level73)
(sum level71 level2 level73)
(sum level71 level3 level74)
(sum level72 level2 level74)
(sum level72 level3 level75)
(sum level73 level2 level75)

(connected l0 l1)
(fuelcost level14 l0 l1)
(connected l0 l3)
(fuelcost level17 l0 l3)
(connected l0 l4)
(fuelcost level13 l0 l4)
(connected l1 l0)
(fuelcost level14 l1 l0)
(connected l1 l2)
(fuelcost level15 l1 l2)
(connected l1 l4)
(fuelcost level15 l1 l4)
(connected l2 l1)
(fuelcost level15 l2 l1)
(connected l2 l3)
(fuelcost level3 l2 l3)
(connected l2 l4)
(fuelcost level2 l2 l4)
(connected l3 l0)
(fuelcost level17 l3 l0)
(connected l3 l2)
(fuelcost level3 l3 l2)
(connected l4 l0)
(fuelcost level13 l4 l0)
(connected l4 l1)
(fuelcost level15 l4 l1)
(connected l4 l2)
(fuelcost level2 l4 l2)

(at t0 l3)
(fuel t0 level75)
(= (total-cost) 0)

(at p0 l2)
(at p1 l4)
(at p2 l1)
(at p3 l0)
(at p4 l0)
(at p5 l0)
(at p6 l3)
(at p7 l1)
(at p8 l4)
(at p9 l0)
(at p10 l1)
(at p11 l0)
)

(:goal
(and
(at p0 l4)
(at p1 l3)
(at p2 l4)
(at p3 l3)
(at p4 l4)
(at p5 l3)
(at p6 l4)
(at p7 l4)
(at p8 l2)
(at p9 l2)
(at p10 l2)
(at p11 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 0 of 12
2. (drive t0 l3 l0 level58 level17 level75)
   deleted: (at t0 l3) (fuel t0 level75)
   added: (at t0 l0) (fuel t0 level58)
   goals met: 0 of 12
3. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 0 of 12
4. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 0 of 12
5. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 0 of 12
6. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 12
7. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 0 of 12
8. (drive t0 l0 l1 level44 level14 level58)
   deleted: (at t0 l0) (fuel t0 level58)
   added: (at t0 l1) (fuel t0 level44)
   goals met: 0 of 12
9. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 0 of 12
10. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 12
11. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 0 of 12
12. (drive t0 l1 l2 level29 level15 level44)
   deleted: (at t0 l1) (fuel t0 level44)
   added: (at t0 l2) (fuel t0 level29)
   goals met: 0 of 12
13. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 1 of 12
14. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 2 of 12
15. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 2 of 12
16. (drive t0 l2 l4 level27 level2 level29)
   deleted: (at t0 l2) (fuel t0 level29)
   added: (at t0 l4) (fuel t0 level27)
   goals met: 2 of 12
17. (load p1 t0 l4)
   deleted: (at p1 l4)
   added: (in p1 t0)
   goals met: 2 of 12
18. (load p8 t0 l4)
   deleted: (at p8 l4)
   added: (in p8 t0)
   goals met: 2 of 12
19. (unload p0 t0 l4)
   deleted: (in p0 t0)
   added: (at p0 l4)
   goals met: 3 of 12
20. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 4 of 12
21. (unload p4 t0 l4)
   deleted: (in p4 t0)
   added: (at p4 l4)
   goals met: 5 of 12
22. (unload p6 t0 l4)
   deleted: (in p6 t0)
   added: (at p6 l4)
   goals met: 6 of 12
23. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 7 of 12
24. (drive t0 l4 l2 level25 level2 level27)
   deleted: (at t0 l4) (fuel t0 level27)
   added: (at t0 l2) (fuel t0 level25)
   goals met: 7 of 12
25. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 8 of 12
26. (drive t0 l2 l3 level22 level3 level25)
   deleted: (at t0 l2) (fuel t0 level25)
   added: (at t0 l3) (fuel t0 level22)
   goals met: 8 of 12
27. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 9 of 12
28. (unload p11 t0 l3)
   deleted: (in p11 t0)
   added: (at p11 l3)
   goals met: 10 of 12
29. (unload p3 t0 l3)
   deleted: (in p3 t0)
   added: (at p3 l3)
   goals met: 11 of 12
30. (unload p5 t0 l3)
   deleted: (in p5 t0)
   added: (at p5 l3)
   goals met: 12 of 12
